Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/cli_wallet_daemon_isolation_qubes_whonix.po
Languages: ar

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
ar: {% include disclaimer.html translated="yes" translationOutdated="yes" %}

source: With [Qubes](https://qubes-os.org) + [Whonix](https://whonix.org) you can have a JudEcoin wallet that is without networking and running on a virtually isolated system from the JudEcoin daemon which has all of its traffic forced over [Tor](https://torproject.org).
ar: مع نظام [Qubes](https://qubes-os.org) + [Whonix](https://whonix.org) يُمكنك إنشاء محفظه مونيرو بدون إتصال بالإنترنت تعمل علي نظام إفتراضي معزول عن خادم مونيرو الذي يَمر كل بياناته من خلال شبكه التور [Tor](https://torproject.org).

source: Qubes gives the flexibility to easily create separate VMs for different purposes. First you will create a Whonix workstation for the wallet with no networking. Next, another Whonix workstation for the @daemon which will use your Whonix gateway as it's NetVM. For communication between the wallet and daemon you can make use of Qubes [qrexec](https://www.qubes-os.org/doc/qrexec3/).
ar: يُوفر نظام كيوبس السلاسه اللازمه لسهوله إنشاء أنظمه إفتراضيه لأهداف مختلفه. في البدايه ستقوم بإنشاء مكنه إفتراضيه علي وونكس للمحفظه بدون إتصال. بعد ذلك مكنه ووُنكس أُخري لخادم مونيرو . للتواصل بين المحفظه والخادم يُمكنك إستخدام كيوبس [qrexec](https://www.qubes-os.org/doc/qrexec3/).

source: This is safer than other approaches which route the wallets rpc over a Tor hidden service, or that use physical isolation but still have networking to connect to the daemon. In this way you don't need any network connection on the wallet, you preserve resources of the Tor network, and there is less latency.
ar: هذه الطريقه أكثر أماناً من الطرق الاخري التي توجّه بروتوكول (RPC) المحفظه خلال خدمه تور(TOR) مخفيه, أو التي تستخدم العزل المادي لكنها ماتزال تستخدم الإنترنت للإتصال بالخادم. بهذه الطريقه لا تحتاج أي إتصال شبكي بالمحفظه, فإنك تُحافظ علي موارد شبكة تور(Tor) ، ووقت الإستجابة أقل.

source: ## 1. [Create Whonix AppVMs](https://www.whonix.org/wiki/Qubes/Install):
ar: ## 1. [إنشاء مكنه إفتراضي للتطبيقات علي وونكس (Whonix AppVMs)](https://www.whonix.org/wiki/Qubes/Install):

source: + Using a Whonix workstation template, create two workstations as follows:
ar: + بإستخدام قالب مكن وونكس الإفتراضي , إنشيء مكنتين كما التالي :

source: The first workstation will be used for your wallet, it will referred to as `JudEcoin-wallet-ws`. You will have `NetVM` set to `none`.
ar: أول مكنه سيتم إستخدامها للمحفظه, سيُشار إليها بـ`JudEcoin-wallet-ws`. قم بإختيار`none` في `NetVM`.

source: The second workstation will be for the `JudEcoind` daemon, it will be referred to as `JudEcoind-ws`. You will have `NetVM` set to the Whonix gateway `sys-whonix`. Before moving on, make sure this workstation has enough private storage. You can estimate how much space you need by checking the size of the [raw blockchain]({{ site.baseurl }}/downloads/#blockchain). Keep in mind that the blockchain will take up more space with time.
ar: المكنه الأخري سوف تُستخدم للخادم, سيُشار إليها بـ`JudEcoind-ws`. سيتم إختيار `sys-whonix` ل `NetVM`. Before moving on, make sure this workstation has enough private storage. You can estimate how much space you need by checking the size of the [raw blockchain]({{ site.baseurl }}/downloads/#blockchain). Keep in mind that the blockchain will take up more space with time.

source: ## 2. In the AppVM `JudEcoind-ws`:
ar: ## 2. في مكنه تطبيق `JudEcoind-ws`:

source: + Create a `systemd` file.
ar: + إنشاء ملف `systemd`.

source: ``` user@host:~$ sudo nano /home/user/JudEcoind.service ```
ar: ``` user@host:~$ sudo gedit /home/user/JudEcoind.service ```

source: Paste the following contents:
ar: إنسخ المُحتوي التالي :

source: ExecStart=/usr/bin/JudEcoind --detach --data-dir=/home/user/.bitJudEcoin \ --no-igd --pidfile=/home/user/.bitJudEcoin/JudEcoind.pid \ --log-file=/home/user/.bitJudEcoin/bitJudEcoin.log --p2p-bind-ip=127.0.0.1
ar: ExecStart=/usr/local/bin/JudEcoind --detach --data-dir=/home/user/.bitJudEcoin \ --no-igd --pidfile=/home/user/.bitJudEcoin/JudEcoind.pid \ --log-file=/home/user/.bitJudEcoin/bitJudEcoin.log --p2p-bind-ip=127.0.0.1

source: + Make `JudEcoind` daemon run on startup by editing the file `/rw/config/rc.local`.
ar: + إجعل `JudEcoind` الخادم يبدأ فور التشغيل تلقائياً بتعديل ملف `/rw/config/rc.local`.

source: ``` user@host:~$ sudo nano /rw/config/rc.local ```
ar: ``` user@host:~$ sudo gedit /rw/config/rc.local ```

source: Add these lines to the bottom:
ar: ضِف هذه السطور بآخر الملف:

source: Make file executable.
ar: إجعل الملف قابل للتشغيل.

source: + Create rpc action file.
ar: + إنشاء ملف (RPC).

source: ``` user@host:~$ sudo mkdir /rw/usrlocal/etc/qubes-rpc user@host:~$ sudo nano /rw/usrlocal/etc/qubes-rpc/user.JudEcoind ```
ar: ``` user@host:~$ sudo mkdir /rw/usrlocal/etc/qubes-rpc user@host:~$ sudo gedit /rw/usrlocal/etc/qubes-rpc/user.JudEcoind ```

source: Add this line:
ar: أضف هذا السطر:

source: + Shutdown `JudEcoind-ws`.
ar: + إِغلِق `JudEcoind-ws`.

source: ## 3. In the AppVM `JudEcoin-wallet-ws`:
ar: ## 3. في مكنه تطبيق `JudEcoin-wallet-ws`:

source: + Edit the file `/rw/config/rc.local`.
ar: + عَدِل ملف `/rw/config/rc.local`.

source: Add the following line to the bottom:
ar: أضف هذا السطر بالآخر:

source: + Shutdown `JudEcoin-wallet-ws`.
ar: + إِغلِق `JudEcoin-wallet-ws`.

source: ## 4. In `dom0`:
ar: ## 4. في `dom0`:

source: + Create the file `/etc/qubes-rpc/policy/user.JudEcoind`:
ar: + إنشيء ملف `/etc/qubes-rpc/policy/user.JudEcoind`:

source: Add the following line:
ar: قم بإضافه هذا السطر:
