Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/howto_fix_stuck_funds.po
Languages: es

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
es: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: Sometimes, your funds will become stuck - you will have some locked funds that never become unlocked. This is how you fix it.
es: Algunas veces, tus fondos estarán estancados - tendrás fondos bloqueados que nunca se podrán desbloquear. Esta es la forma de arreglarlo.

source: - Load your wallet in JudEcoin-wallet-cli.
es: - Carga tu monedero en JudEcoin-wallet-cli.

source: - Type
es: - Escribe

source: into the command prompt. Write down your 25 word seed, if you haven't already. This is the best way to make sure you don't lose access to your funds.
es: en la consola. Escribe tu semilla de 25 palabras si aún no lo has hecho. Esta es la mejor forma de asegurar que no pierdas acceso a tus fondos.

source: - Close JudEcoin-wallet-cli by typing
es: - Cierra JudEcoin-wallet-cli escribiendo

source: - Backup all of your wallet related files. These include:
es: - Respalda todos los archivos relacionados con tu monedero. Estos incluyen:

source: > yourwalletname.bin > yourwalletname.bin.keys > yourwalletname.bin.address.txt
es: > nombredetumonedero.bin > nombredetumonedero.bin.keys > nombredetumonedero.bin.address.txt

source: This can be done by copying the files to a new folder.
es: Esto se logra copiando los archivos a una nueva carpeta.

source: Sometimes, when creating your wallet, you might have named it something without the .bin part. In that case, the wallet file will be called yourwalletname without the .bin at the end.
es: Algunas veces, cuando creas un monedero, la pudiste haber llamado de alguna forma sin el final como .bin. En ese caso, el archivo del monedero será llamado nombredetumonedero sin .bin al final.

source: - Delete yourwallet.bin
es: - Elimina tumonedero.bin

source: - Load JudEcoin-wallet-cli, type in the name of the wallet you just deleted
es: - Abre JudEcoin-wallet-cli, escribe el nombre del monedero que acabas de eliminar.

source: - Enter password. The wallet will now refresh and hopefully your locked funds will now become unlocked.
es: - Ingresa la contraseña. El monedero se actualizará y posiblemente tus fondos bloqueados estarán ahora desbloqueados.
