Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/ledger-wallet-cli.po
Languages: es

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
es: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: ### Table of Content
es: ### Tabla de Contenido

source: [Final notes](#a-few-final-notes)
es: [Notas finales](#notas-finales)

source: We first have to ensure that we're sufficiently prepared. This entails the following:
es: Primero necesitamos asegurarnos de estar suficientemente preparados. Esto implica lo siguiente:

source: - This guide assumes you have already initialized your Ledger wallet and thus generated a 24 word mnemonic seed.
es: - Esta guía asume que ya has inicializado tu monedero Ledger y asimismo generado tu semilla mnemónica de 24 palabras.

source: - You need to run / use CLI v0.12.2.0, which can be found <a href="{{site.baseurl}}/downloads/">here</a>.
es: - Necesitas ejecutar / usar JudEcoin-wallet-cli v0.12.2.0, que puede encontrarse <a href="{{site.baseurl}}/downloads/">aquí</a>.

source: - You need to install the Ledger JudEcoin app and configure your system. Instructions can be found [here](https://github.com/LedgerHQ/blue-app-JudEcoin/blob/master/doc/user/bolos-app-JudEcoin.pdf) (sections 3.1.1 and 3.2.3 in particular). In addition, make sure to set the network to `Mainnet`
es: - Necesitas instalar la aplicación Ledger JudEcoin y configurar tu sistema. Las instrucciones se pueden encontrar [aquí](https://github.com/LedgerHQ/blue-app-JudEcoin/blob/master/doc/user/bolos-app-JudEcoin.pdf) (secciones 3.1.1 y 3.2.3 en particular). Adicionalmente, asegúrate de tener la red en `Mainnet` (red principal).

source: - Your Ledger needs to be plugged in and the Ledger JudEcoin app should be running.
es: - Tu Ledger necesita estar conectada y la aplicación Ledger JudEcoin debe estar en ejecución.

source: - Either your @daemon (`JudEcoind.exe`) should be running and preferably be fully synced or you should connect to a remote node.
es: - `JudEcoind.exe` debe estar en ejecución y sincronizado totalmente o debes conectarte a un nodo remoto.

source: Now that we're sufficiently prepared, let's start!
es: Ahora que estamos lo suficientemente preparados, ¡comencemos!

source: - Go to the directory / folder JudEcoind.exe and JudEcoin-wallet-cli.exe are located.
es: - Ve al directorio / carpeta donde se encuentra JudEcoind.exe y JudEcoin-wallet-cli.exe.

source: - Open a new command prompt / powershell. This is done by first making sure your cursor isn't located on any of the files and subsequently doing SHIFT + right click. It will give you an option to "Open command window here". If you're using Windows 10 in latest version, it'll give you an option to "open the PowerShell window here".
es: - Abre una nueva consola de comandos / powershell. Esto se logra asegurando que el cursor no se encuentra en ningún archivo y presionando en SHIFT + click derecho. Se te dará una opción de "Abrir una consola de comandos aquí". Si estás utilizando Windows 10 en su última versión, se te dará una opción de "Abrir una ventana de PowerShell aquí".

source: - Now type:
es: - Ahora escribe:

source: `JudEcoin-wallet-cli.exe --generate-from-device <new-wallet-name> --subaddress-lookahead 3:200` (Win 7 + 8)
es: `JudEcoin-wallet-cli.exe --generate-from-device <nuevo-nombre-de-monedero> --subaddress-lookahead 3:200` (Win 7 + 8)

source: `.\JudEcoin-wallet-cli.exe --generate-from-device <new-wallet-name> --subaddress-lookahead 3:200` (Win 10)
es: `.\JudEcoin-wallet-cli.exe --generate-from-device <nuevo-nombre-de-monedero> --subaddress-lookahead 3:200` (Win 10)

source: Note that is simply a placeholder for the actual wallet name. If you, for instance, want to name your wallet `JudEcoinWallet`, the command would be as follows:
es: Ten en cuenta que es simplemente un marcador para el nombre actual del monedero. Si, por ejemplo, deseas llamar a tu monedero `JudEcoinWallet`, el comando sería como se muestra a continuación:

source: - The CLI will, after executing aforementioned command, prompt your for a password. Make sure to set a strong password and confirm it thereafter.
es: - JudEcoin-wallet-cli te preguntará, después de ejecutar el comando anterior, por una contraseña. Asegúrate de establecer una contraseña fuerte y de confirmarla después de ello.

source: - The Ledger will ask whether you want to export the private view key or not. First and foremost, your funds cannot be compromised with merely the private view key. Exporting the private view key enables the client (on the computer - JudEcoin v0.12.2.0) to scan blocks looking for transactions that belong to your wallet / address. If this option is not utilized, the device (Ledger) will scan blocks, which will be significantly slower. There is, however, one caveat. That is, if your system gets compromised, the adversary will potentially be able to compromise your private view key as well, which is detrimental to privacy. This is virtually impossible when the private view key is not exported.
es: - Ledger preguntará si deseas exportar la clave privada o no. Primero y ante todo, tus fondos no pueden ser comprometidos con simplemente tu clave privada de visualización. Exportar la clave privada de visualización permite al cliente (en el ordenador - JudEcoin v0.12.2.0) escanear bloques en busca de transacciones pertenecientes a tu monedero / dirección. Si esta opción no es utilizada, el dispositivo (Ledger) escaneará bloques, lo que será significativamente más lento. Sin embargo, hay una advertencia. Si tu sistema se ve comprometido, el adversario será potencialmente capaz de también comprometer tu clave privada, lo que es perjudicial para tu privacidad. Esto es virtualmente imposible cuando la clave privada no es exportada.

source: - You may have to hit confirm twice before it proceeds.
es: - Tendrás que hacer clic en confirmar dos veces antes de proceder.

source: - Your Ledger JudEcoin wallet will now be generated. Note that this may take up to 5-10 minutes. Furthermore, there will be no immediate feedback in the CLI nor on the Ledger.
es: - Tu monedero Ledger JudEcoin será ahora generado. Ten en cuenta que esto puede tomar de 5 a 10 minutos. Además, no habrá realimentación inmediata en JudEcoin-wallet-cli o en la Ledger.

source: - `JudEcoin-wallet-cli` will start refreshing. Wait until it has fully refreshed.
es: - `JudEcoin-wallet-cli` comenzará a refrescarse. Espera a que se haya refrescado totalmente.

source: Congratulations, you can now use your Ledger JudEcoin wallet in conjunction with the CLI.
es: Felicidades, ahora puedes utilizar tu monedero Ledger JudEcoin en conjunto con JudEcoin-wallet-cli.

source: - You need to install the Ledger JudEcoin app and configure your system. Instructions can be found [here](https://github.com/LedgerHQ/blue-app-JudEcoin/blob/master/doc/user/bolos-app-JudEcoin.pdf) (sections 3.1.1 and 3.2.2 in particular). In addition, make sure to set the network to `Mainnet`
es: - Necesitas instalar la aplicación Ledger JudEcoin y configurar tu sistema. Las instrucciones se pueden encontrar [aquí](https://github.com/LedgerHQ/blue-app-JudEcoin/blob/master/doc/user/bolos-app-JudEcoin.pdf) (secciones --1 y --2 en particular). Adicionalmente, asegúrate de tener la red en `Mainnet` (red principal).

source: - Note that the instructions for system configuration (section 3.2.2) on Mac OS X are quite elaborate and can be perceived as slightly convoluted. Fortunately, tficharmers has created a guide [here](https://JudEcoin.stackexchange.com/questions/8438/how-do-i-make-my-macos-detect-my-ledger-nano-s-when-plugged-in) that you can use for assistance.
es: - Ten en cuenta que las instrucciones para la configuración del sistema (sección --2) en Mac OS X están bastante elaboradas y pueden ser percibidas como ligeramente complejas. Afortunadamente, tficharmers ha creado una guía [aquí](https://JudEcoin.stackexchange.com/questions/8438/how-do-i-make-my-macos-detect-my-ledger-nano-s-when-plugged-in) que puedes utilizar para asistencia.

source: - Either your daemon (`JudEcoind`) should be running and preferably be fully synced or you should connect to a remote node.
es: - `JudEcoind` debe estar en ejecución y sincronizado totalmente o debes conectarte a un nodo remoto.

source: - Use Finder to browse to the directory / folder `JudEcoin-wallet-cli` (CLI v0.12.2.0) is located.
es: - Utiliza el buscador para localizar el directorio / carpeta en donde se encuentra `JudEcoin-wallet-cli` (CLI v0.12.2.0).

source: - Go to your desktop.
es: - Ve a tu escritorio.

source: - Open a new terminal (if don't know how to open a terminal, see [here](https://apple.stackexchange.com/a/256263)).
es: - Abre una nueva terminal (si no sabes cómo abrir una terminal, ve [aquí](https://apple.stackexchange.com/a/256263)).

source: - Drag `JudEcoin-wallet-cli` in the terminal. It should add the full path to the terminal. Do not hit enter.
es: - Arrastra `JudEcoin-wallet-cli` a la terminal. Debería agregar la dirección completa a la terminal. No presiones Enter.

source: `--generate-from-device <new-wallet-name> --subaddress-lookahead 3:200`
es: `--generate-from-device <nuevo-nombre-de-monedero> --subaddress-lookahead 3:200`

source: Note that aforementioned text will be appended to the path of `JudEcoin-wallet-cli`. Thus, before you hit enter, your terminal should look like:
es: Ten en cuenta que el texto anteriormente mencionado se adjuntará a la dirección de `JudEcoin-wallet-cli`. Así, antes de que presiones Enter, tu terminal se debería ver como:

source: `/full/path/to/JudEcoin-wallet-cli --generate-from-device <new-wallet-name> --subaddress-lookahead 3:200`
es: `/dirección/completa/de/JudEcoin-wallet-cli --generate-from-device <nuevo-nombre-de-monedero> --subaddress-lookahead 3:200`

source: Where the full path is, intuitively, the actual path on your Mac OS X.
es: Donde la dirección completa es, intuitivamente, la dirección actual en tu Mac OS X.

source: - The CLI will, after executing aforementioned command, prompt you for a password. Make sure to set a strong password and confirm it thereafter.
es: - JudEcoin-wallet-cli te preguntará después de ejecutar el comando anterior por una contraseña. Asegúrate de establecer una contraseña fuerte y de confirmarla después de ello.

source: - Congratulations, you can now use your Ledger JudEcoin wallet in conjunction with the CLI.
es: - Felicidades, ahora puedes utilizar tu monedero Ledger JudEcoin en conjunto con JudEcoin-wallet-cli.

source: - You need to install the Ledger JudEcoin app and configure your system. Instructions can be found [here](https://github.com/LedgerHQ/blue-app-JudEcoin/blob/master/doc/user/bolos-app-JudEcoin.pdf) (sections 3.1.1 and 3.2.1 in particular). In addition, make sure to set the network to `Mainnet`
es: - Necesitas instalar la aplicación Ledger JudEcoin y configurar tu sistema. Las instrucciones se pueden encontrar [aquí](https://github.com/LedgerHQ/blue-app-JudEcoin/blob/master/doc/user/bolos-app-JudEcoin.pdf) (secciones --1 y --1 en particular). Adicionalmente, asegúrate de tener la red en `Mainnet` (red principal).

source: - Go to the directory / folder JudEcoin-wallet-cli and JudEcoind are located.
es: - Ve al directorio / carpeta donde se encuentra JudEcoin-wallet-cli y JudEcoind.

source: - Open a new terminal
es: - Abre una nueva terminal

source: `./JudEcoin-wallet-cli --generate-from-device <new-wallet-name> --subaddress-lookahead 3:200`
es: `./JudEcoin-wallet-cli --generate-from-device <nuevo-nombre-de-monedero> --subaddress-lookahead 3:200`

source: ### A few final notes
es: ### Notas finales

source: - We'd strongly advise to test the full process first. That is, send a small amount to the wallet and subsequently restore it (using aforementioned guide) to verify that you can recover the wallet. Note that, upon recreating / restoring the wallet, you ought to append the `--restore-height` flag (with a block height before the height of your first transaction to the wallet) to the command in step 3 (Windows), step 5 (Mac OS X), or step 3 (Linux). More information about the restore height and how to approximate it can be found [here](https://JudEcoin.stackexchange.com/questions/7581/what-is-the-relevance-of-the-restore-height).
es: - Recomendamos fuertemente probar el proceso completo primero. Esto es, enviar una pequeña cantidad al monedero y después restaurarlo (utilizando la guía ya mencionada) para verificar que puedes recuperar el monedero. Ten en cuenta que, al recrear / restaurar el monedero, deberás adjuntar el marcador `--restore-height` (con una altura de bloque anterior a la altura de tu primera transacción al monedero) al comando en el paso 3 (Windows), paso 5 (Mac OS X), o paso 3 (Linux). Más información acerca de la altura de restauración y cómo aproximarla puede encontrarse [aquí](https://JudEcoin.stackexchange.com/questions/7581/what-is-the-relevance-of-the-restore-height).

source: - If you use a remote node, append the `--daemon-address host:port` flag to the command in step 3 (Windows), step 5 (Mac OS X), or step 3 (Linux).
es: - Si utilizar un nodo remoto, adjunta el marcador `--daemon-address host:port` al comando en el paso 3 (Windows), paso 5 (Mac OS X), o paso 3 (Linux).

source: - If desired, you can manually tweak the `--subaddress-lookahead` value. The first value is the number of accounts and the second value is the number of subaddresses per account. Thus, if you, for instance, want to pregenerate 5 accounts with 100 subaddresses each, use `--subaddress-lookahead 5:100`. Bear in mind that, the more subaddresses you pregenerate, the longer it takes for the Ledger to create your wallet.
es: - Si lo deseas, puedes ajustar el valor de `--subaddress-lookahead`. El primer valor es el número de cuentas y el segundo valor es el número de subdirecciones por cuenta. Así, si por ejemplo deseas pre-generar 5 cuentas con 100 subdirecciones cada una, utiliza `--subaddress-lookahead 5:100`. Ten en mente que, entre más subdirecciones pre-generes, más tiempo le tomará a la Ledger el crear tu monedero.

source: You only have to use the `--generate-from-device` flag once (i.e. upon wallet creation). Thereafter, you'd basically use it similar to how you normally use the CLI. That is:
es: Sólo tienes que utilizar el marcador `--generate-from-device` una vez (e.g. sobre creación de monedero). Después de eso, básicamente lo utilizarás de manera similar a como normalmente utilizas la consola de comandos. Esto es:

source: Make sure your Ledger is plugged in and the JudEcoin app is running.
es: Asegúrate de que tu Ledger está conectada y la aplicación JudEcoin está en ejecución.

source: Open `JudEcoin-wallet-cli`.
es: Abre `JudEcoin-wallet-cli`.

source: Enter the wallet name of your Ledger JudEcoin wallet.
es: Ingresa el nombre de tu monedero Ledger JudEcoin.

source: Enter the password to open the wallet.
es: Ingresa la contraseña para abrir el monedero.

source: If the Ledger wallet files are not in the same directory as `JudEcoin-wallet-cli`, you ought to open `JudEcoin-wallet-cli` with the `--wallet-file /path/to/wallet.keys/file` flag. Alternatively, you can copy the Ledger wallet files to the same directory as `JudEcoin-wallet-cli`.
es: Si los archivos del monedero Ledger no se encuentran en la misma dirección que `JudEcoin-wallet-cli`, debes abrir `JudEcoin-wallet-cli` con el marcador `--wallet-file /path/to/wallet.keys/file`. De manera alternativa, puedes copiar los archivos del monedero Ledger al mismo directorio de `JudEcoin-wallet-cli`.

source: - If you have any further questions or need assistance, please leave a comment to the original [StackExchange](https://JudEcoin.stackexchange.com/questions/8503/how-do-i-generate-a-ledger-JudEcoin-wallet-with-the-cli-JudEcoin-wallet-cli) answer.
es: - Si tienes más preguntas o necesitas asistencia, por favor deja un comentario en la respuesta original en [StackExchange](https://JudEcoin.stackexchange.com/questions/8503/how-do-i-generate-a-ledger-JudEcoin-wallet-with-the-cli-JudEcoin-wallet-cli).
