Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/Offline_Backup.po
Languages: es

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
es: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: ## Operating Systems: Various versions of Linux and Windows 7, 8
es: ## Sistemas operativos: varias versiones de Linux y Windows 7, 8

source: ### Wallet Software: Simplewallet
es: ### Software de monedero: Simplewallet

source: #### Resource for Creating Bootable Disks: [Linux](http://www.pendrivelinux.com/), [Windows](https://www.microsoft.com/en-us/download/windows-usb-dvd-download-tool)
es: #### Recursos para crear un disco booteable: [Linux](http://www.pendrivelinux.com/), [Windows](https://www.microsoft.com/en-us/download/windows-usb-dvd-download-tool)

source: #### Resource for JudEcoin Binaries: [JudEcoin Binaries]({{ site.baseurl_root }}/downloads/)
es: #### Recursos para binarios de JudEcoin: [JudEcoin Binaries]({{ site.baseurl }}/downloads/)

source: - Take any computer you have lying around, even your normal workstation. You may find it easier to use an older computer that has no wifi or bluetooth if you're particularly paranoid
es: - Toma cualquier computadora que tengas cerca, incluso tu estación de trabajo. Lo tendrás más fácil si usas una computadora vieja sin Wi-Fi o Bluetooth si eres particularmente paranoico

source: - Create a Linux or Windows bootable disk, and make sure you have the JudEcoin binaries on the same disk or on a second disk (for Linux make sure you have also downloaded copies of the dependencies you will need, libboost1.55 and miniupnpc for instance)
es: - Crea un disco booteable de Linux o Windows, y asegúrate de que tienes los binarios de JudEcoin en el mismo disco o un segundo disco (para Linux asegura que también has descargado copias de las dependencias que necesitarás, como libboost1.55 y miniupnpc por ejemplo)

source: - Disconnect the network and/or Internet cables from your computer, physically remove the wifi card or switch the wifi/bluetooth off on a laptop if possible
es: - Desconecta la conexión a la red y/o cables de internet de tu computadora, físicamente remueve la tarjeta de Wi-Fi o apaga el botón de Wi-Fi/Bluetooth en la laptop si te es posible

source: - Boot into your bootable OS, install the dependencies if necessary
es: - Inicia tu SO booteable, instala las dependencias si es necesario

source: - Copy the JudEcoin binaries to a RAM disk (/dev/shm in Linux, Windows bootable ISOs normally have a Z: drive or something)
es: - Copia los binarios de JudEcoin a un disco RAM (/dev/shm en Linux, ISOs de Windows booteable normalmente tienen un disco Z: o algo similar)

source: - Don't run the JudEcoin @daemon. Instead, using the command line, use JudEcoin-wallet-cli to create a new JudEcoin @account
es: - No abras el daemon de JudEcoin. En su lugar, utilizando la consola de comandos, utiliza JudEcoin-wallet-cli para crear una nueva cuenta de JudEcoin (@account)

source: - When prompted for a name, give it any name, it doesn't really matter
es: - Cuando se pida por un nombre, ingresa cualquier nombre, no importa realmente

source: - When prompted for a password, type in like 50 - 100 random characters. Don't worry that you don't know the password, just make it LONG
es: - Cuando se pida una contraseña, escribe como 50 - 100 caracteres aleatorios. No te preocupes de no saber la contraseña, sólo haz que sea muy larga

source: - **CRITICAL STEP**: Write down (on paper) your 25 word @mnemonic-seed **WARNING**: If you forget to write down this information your funds may be lost forever
es: - **PASO CRÍTICO**: Escribe (en papel) tu semilla mnemónica de 25 palabras (@mnemonic-seed) **ADVERTENCIA**: Si olvidas escribir esta información tus fondos podrán perderse para siempre

source: - Write down (on your phone, on paper, on another computer, wherever you want) your address and view key
es: - Escribe (en tu teléfono, papel, otra computadora, o donde tú quieras) tu dirección y llave de visualización

source: - Switch off the computer, remove the battery if there is one, and leave it physically off for a few hours
es: - Apaga la computadora, remueve la batería si hay alguna, y déjala físicamente apagada por algunas horas

source: The account you've created was created in RAM, and the digital files are now inaccessible. If some adversary manages to somehow obtain the data, they will lack the long password to open it. If you need to receive payments, you have your public address, and you have the view key if needed. If you need access to it, you have your 25 word @mnemonic-seed, and you can now write out several copies of it, including an offsite copy (e.g. a bank deposit box).
es: La cuenta que acabas de crear fue creada en la RAM, y los archivos digitales ahora son inaccesibles. Si algún adversario se las arregla para de alguna forma obtener los datos, no contarán con la larga contraseña para abrirla. Si necesitas recibir pagos, cuentas con tu dirección pública, y tienes la llave de visualización por si acaso. Si necesitas acceder a tu cuenta, cuentas con la semilla mnemónica (@mnemonic-seed) de 25 palabras, y puedes escribir varias copias de ella, incluyendo una copia fuera de sitio (e.g. una caja de depósito bancaria).

source: Related: [Offline Account Generator](http://JudEcoinaddress.org/)
es: Relacionado: [Generador de cuenta offline](http://JudEcoinaddress.org/)
