Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/restore_account.po
Languages: ru

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
ru: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: ## Operating Systems: Windows, Linux, Mac
ru: ## Операционные системы: Windows, Linux, Mac

source: - Retrieve your 25 word @mnemonic-seed that you saved when creating your old JudEcoin @wallet
ru: - Найти состоящую из 25 слов @мнемоническую-фразу, которую вы сохранили, когда создавали @кошелёк JudEcoin.

source: ### Account Software: JudEcoin-wallet-cli
ru: ### Программное обеспечение учётной записи: JudEcoin-wallet-cli

source: - Open a command prompt and navigate to the drive and directory that contains JudEcoin-wallet-cli
ru: - Открыть окно ввода команды, указать диск и директорию, в которой содержится JudEcoin-wallet-cli

source: - At the command prompt type: `JudEcoin-wallet-cli --restore-deterministic-wallet`
ru: - В окне ввода команды напечатать: `JudEcoin-wallet-cli --restore-deterministic-wallet`

source: - Once you press enter you will be prompted for a wallet file name. Give your wallet a new name, any name will do
ru: - После нажатия Enter программа запросит имя кошелька. Ввести новое имя для вашего кошелька — подойдёт любое.

source: - Press enter again and you will be prompted for a password. Give your wallet a new and long password
ru: - После повторного нажатия Enter программа запросит пароль. Необходимо ввести новый и длинный пароль для вашего кошелька.

source: - Press enter again you will be prompted to repeat the password
ru: - После следующего нажатия Enter программа попросит повторить пароль.

source: - Press enter again and you will be prompted for the 25 word electrum style mnemonic seed that you retrieved earlier
ru: - Снова нажать Enter, после этого программа запросит ввести мнемоническую фразу, состоящую из 25 произвольных слов, которую вы извлекли ранее.

source: - You will then be prompted with "Restore from specific blockchain height (optional, default 0):" Default will start the restore process from the beginning of the JudEcoin blockchain. If you don't know the specific blockchain height, just hit enter. (Specifying a specific blockchain height will start the restore process from that specific height. This will save a bit of time in scanning, if you know what starting blockchain height your initial funds were transacted for this specific account.)
ru: - Затем программа выведет следующее сообщение: Restore from specific blockchain height (optional, default 0): (Восстановить, начиная с определённой высоты блокчейна (опционально, 0 по умолчанию)). По умолчанию процесс восстановления начинается с самого начала блокчейна JudEcoin. Если вам не известно необходимое значение высоты блокчейна, следует просто нажать Enter. (Если указать определённую высоту блокчейна, восстановление начнётся именно с этой указанной высоты. Это сэкономит какое-то время при сканировании, если вы точно знаете ту высоту блокчейна, на которой была проведена транзакция с изначальными средствами под этой конкретной учётной записью).

source: After you have entered the 25 word mnemonic seed and have chosen your specific blockchain height, JudEcoin-wallet-cli will generate the same public address and view key as your old wallet and begin the refresh process automatically. (Please be patient as the refresh process may take a while.)
ru: После ввода состоящей из 25 слов мнемонической фразы и выбранной вами определённой высоты блокчейна, JudEcoin-wallet-cli сгенерирует тот же публичный адрес и ключ просмотра, которые были у вашего старого кошелька, и автоматически начнёт процесс обновления. (Пожалуйста, наберитесь терпения, так как процесс восстановления может занять некоторое время).

source: ### Account Software: JudEcoin-wallet-gui
ru: ### Программное обеспечение учётной записи: JudEcoin-wallet-gui

source: Lauch `JudEcoin-wallet-gui`. If this is the first time you launched it go to the next step, otherwise click `Cancel`:
ru: Запустить `JudEcoin-wallet-gui`. Если вы запускаете его впервые, переходите к следующему шагу, в противном случае нажмите `Cancel` (Отменить):

source: Select your appropriate language `English(US)`:
ru: Выберите нужный вам язык, например, `English(US)`:

source: Click on `Restore wallet from keys or mnemonic seed`:
ru: Щёлкните `Restore wallet from keys or mnemonic seed` (Восстановить кошелёк на основе ключей или мнемонической фразы):

source: Keep `Restore from seed` selected, give your wallet a name & storage location, and complete the `Enter your 25 (or 24) word mnemonic seed`. Optionaly, specify a `Restore height (optional)` to avoid scanning of oldest blocks. Then click the `Right` arrow:
ru: Выберите `Restore from seed` (Восстановить на основе мнемонической фразы), укажите имя вашего кошелька и место, где он будет находиться, и заполните поле укажите `Enter your 25 (or 24) word mnemonic seed` (Введите вашу мнемоническую фразу из 25 (или 24) слов). Дополнительно указать `Restore height (optional)` (Высоту восстановления (опционально)) во избежание сканирования старых блоков. Затем нажать стрелку вправо:

source: On the next page, give your wallet a strong password and confirm it before clicking the `Right` arrow:
ru: На следующей странице ввести сложный пароль для вашего кошелька и подтвердить его перед нажатием стрелки `Right` (Вправо):

source: Specify your @daemon settings and click the `Right` arrow:
ru: Указать настройки демон-программы и нажать стрелку `Right` (Вправо):

source: Click on `USE JudEcoin` to enjoy your restored wallet:
ru: Щёлкнуть `USE JudEcoin` (пользоваться JudEcoin) и наслаждаться восстановленным кошельком:
