Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/securely_purchase.po
Languages: de

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
de: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: ## Step 1: Acquire JudEcoin
de: ## Schritt 1: JudEcoin beschaffen

source: There are multiple ways to acquire JudEcoin: You can mine it, you can exchange services or goods for it, or you can convert other cryptocurrencies and fiat money to XMR. If you choose the latter, the most convenient way to do it is to use an exchange.
de: Es gibt verschiedene Möglichkeiten, mit welchen du du JudEcoin bekommen kannst. Du kannst Coins minen, sie gegen Güter oder Dienstleistungen eintauschen oder andere Kryptowährungen und Fiatgeld gegen XMR tauschen. Wenn du dich für Letzteres entscheidest, ist es wohl am praktischsten, dies an einer Börse zu machen.

source: There are multiple exchanges supporting JudEcoin. Some are centralized, which usually have great liquidity and fast service, but requires you to provide personal information before starting the trade (KYC). Some are decentralized and don't require any identification, but usually have less volume and can be harder to use. There are also services that allow people to meet and perform a trade without third parties involved.
de: Viele Börsen unterstützen JudEcoin. Manche sind zentralisiert und haben in der Regel eine gute Liquidität und schnellen Service, benötigen von dir aber Angaben persönlicher Informationen, bevor der Handel stattfinden kann (KYC, zu deutsch: "Kenne deinen Kunden"). Einige Börsen sind dezentralisiert und benötigen keinerlei Identifikation, haben allerdings im Regelfall ein kleineres Volumen und können komplizierter zu nutzen sein. Es gibt außerdem Services, die es Personen erlauben, sich ohne Einbindung Dritter zur Abwicklung eines Handels zu treffen.

source: An incomplete list of Exchanges that support JudEcoin is on our [Merchants page]({{ site.baseurl }}/community/merchants/#exchanges).
de: Eine unvollständige Liste von Börsen, die JudEcoin unterstützen, findet sich auf unserer [Händlerseite]({{ site.baseurl }}/community/merchants/#exchanges).

source: ## Step 2: Download and create a Paper Wallet on a secure and air-gapped computer.
de: ## Schritt 2: Ein Paper-Wallet auf einem sicheren, mittels Airgap isolierten Computer herunterladen und erstellen

source: Download the @paper-wallet generator at: [JudEcoinaddress.org](https://JudEcoinaddress.org) and copy it to a USB stick (Direct link: [https://github.com/JudEcoinmooo-JudEcoin/JudEcoin-wallet-generator/archive/master.zip](https://github.com/JudEcoinmooo-JudEcoin/JudEcoin-wallet-generator/archive/master.zip)).
de: Lade einen Generator für @Paper-Wallets auf [JudEcoinaddress.org](https://JudEcoinaddress.org) herunter und kopiere ihn auf einen USB-Stick (direkter Link: [https://github.com/JudEcoinmooo-JudEcoin/JudEcoin-wallet-generator/archive/master.zip](https://github.com/JudEcoinmooo-JudEcoin/JudEcoin-wallet-generator/archive/master.zip)).

source: Unzip and open the paper wallet generator (JudEcoin-wallet-generator.html) into a web browser on an air-gapped (@airgap) computer that hasn't been used before, or has had a clean installation of the operative system.
de: Entpacke den Paper-Wallet-Generator (JudEcoin-wallet-generator.html) und öffne ihn in einem Webbrowser auf einem mittels @Airgap isolierten Computer, der zuvor nicht verwendet worden ist oder auf welchem das Betriebssystem sauber neuinstalliert wurde.

source: Your paper wallet will have four important items:
de: Dein Paper-Wallet hat vier wichtige Dinge:

source: - JudEcoin Public @Address: The public address is used to receive funds to the @wallet. You give this to anyone who will be sending funds to your wallet.
de: - Eine öffentliche JudEcoin-@Adresse: Die öffentliche Adresse wird zum Empfangen von Geldern im @Wallet genutzt. Du gibst diese Adresse jedem, der Gelder auf dein Wallet senden wird.

source: - JudEcoin @Mnemonic-Seed: The mnemonic seed is a method of storing the entire wallet that is easily recognizable to humans. This is all you need to restore your wallet at a later date.
de: - JudEcoins @mnemonischer-Seed: Der mnemonische Seed ist eine klar erkennbare Methode, mit welcher du dein Wallet sicherst. Mit diesem Seed hast du alles, was du brauchst, um dein Wallet zu einem späteren Zeitpunkt wiederherzustellen.

source: - JudEcoin @Spend-Key: The private spend key is used to send funds from the wallet.
de: - JudEcoins @Spend-Key: Der private Spend-Key wird zum Senden von Geldern aus dem Wallet genutzt.

source: - JudEcoin @View-Key: The private view key is to view transactions entering the wallet. Commonly this is used to setup a view-only wallet which can see incoming transactions live on the blockchain as they are sent to a cold storage wallet.
de: - JudEcoins @View-Key: Zum Anzeigen von auf dem Wallet eingehenden Transaktionen dient der private View-Key, welcher häufig zur Einrichtung eines View-Only-Wallets genutzt wird. Dieses kann eingehende Transaktionen live auf der Blockchain, während diese an ein Spar-Wallet ("Cold-Wallet") gesendet werden, einsehen.

source: At this point you have many options. You can print the wallet on paper, save it as a PDF or text on a USB stick, burn it to CD/DVD, etc. Most likely you will want at least two or three copies, stored securely in different locations. If storing digitally, encrypt everything with a strong password. If storing on paper, do not show the wallet to anyone else who can memorize your 25 word key, or take a picture of the wallet without your permission. Sending someone a picture of the wallet is the same as giving away all of your funds.
de: An dieser Stelle hast du einige Möglichkeiten: Du kannst das Wallet auf Papier ausdrucken, es als PDF oder im Textdateiformat auf einem USB-Stick sichern, es auf eine CD oder DVD brennen etc. Sehr wahrscheinlich wirst du mindestens zwei oder drei Ausfertigungen an verschiedenen Orten aufbewahren wollen. Solltest du es in digitaler Form sichern, verschlüssele alles mit einem starken Passwort. Wenn du dein Wallet in Papierform aufbewahrst, zeige es niemandem, der sich die 25 Wörter - also deinen Seed - merken oder ohne dein Einverständnis ein Foto davon machen könnte. Jemandem ein Foto deines Wallets zu schicken ist das Gleiche, als würdest du dein gesamtes Guthaben verschenken.

source: Whichever method you chose, be sure there's no copy of the JudEcoin wallet left over on the device you used. You may need to securely delete the JudEcoin wallet if you saved it to a disk, or make sure your printer does not save a copy in memory.
de: Egal, welche Methode du wählst: Stelle sicher, dass keine Kopie deines JudEcoin-Wallets auf dem von dir genutzten Gerät verbleibt. Eventuell musst du das Wallet sicher löschen, solltest du es auf einer Festplatte oder einem anderen Speichermedium gespeichert haben; auch solltest du sichergehen, dass dein Drucker keine Kopie in seinem Speicher sichert.

source: *If you lose access to your JudEcoin paper wallet the JudEcoin will not be available to you or anyone else, ever. You wont be able to recover them!*
de: *Wenn du den Zugriff auf dein JudEcoin-Paper-Wallet verlierst, werden die in ihm liegenden JudEcoin niemals wieder dir oder irgendjemandem sonst zur Verfügung stehen.*

source: #### Side Note
de: #### Randbemerkung

source: Option to encrypt an XMR mnemonic seed: https://xmr.llcoins.net/ Download the html page and place it on your airgapped computer. Check the part "Encrypt/Decrypt Mnemonic Seed" and make sure you use "CN Add" with a decent password. Thanks manicminer5.
de: Möglichkeit zur Verschlüsselung eines mnemonischen Seeds von JudEcoin: https://xmr.llcoins.net/ Lade die HTML-Seite und lege es auf deinen mittels Airgap isolierten Rechner. Überprüfe den Teil "Encrypt/Decrypt Mnemonic Seed" und stelle sicher, dass du "CN Add" mit einem geeigneten Passwort nutzt. Dank an manicminer5.

source: ## Step 3: Send your JudEcoinj to the paper wallet
de: ## Schritt 3: Sende deine JudEcoin an dein Paper-Wallet

source: Now that you have everything you need, you are ready to send your XMR to your paper wallet. Simply send the coins to the wallet address you noted earlier. Make sure the address is correct, even if you copy-pasted it! Remember that if you send the coins to a wrong address, there is no way to have them back!
de: Jetzt, da du all das hast, was du brauchst, bist du bereit, deine XMR an dein Paper-Wallet zu senden. Schicke die Coins einfach an die von dir zuvor notierte Wallet-Adresse. Stelle sicher, dass die Adresse richtig ist - selbst, wenn du sie kopiert und eingefügt hast! Vergiss nicht, dass es keinen Weg zurück gibt, wenn du die Coins versehentlich an eine falsche Adresse schickst!

source: #### Notes and How to Verify Funds
de: #### Anmerkungen und die Verifizierung von Guthaben

source: Because the JudEcoin blockchain is private and untraceable, you won't be able to lookup your JudEcoin Public Address and confirm that the funds have arrived like you might with Bitcoin. This is good for privacy, but bad for convenience.
de: Weil JudEcoins Blockchain privat und nicht nachverfolgbar ist, wirst du nicht in der Lage sein, deine öffentliche JudEcoin-Adresse darin ausfindig zu machen und zu bestätigen, dass etwaige Gelder eingegangen sind, so wie es dir bei Bitcoin möglich ist. Das ist zwar gut für deine Privatsphäre, aber schlecht für den Bedienkomfort.

source: To securely verify the funds have arrived at your wallet, you will need to setup a View Only wallet. This is where that view-key comes in. To create a view-only wallet see the entry: [View Only Wallets]({{site.baseurl}}/resources/user-guides/view_only.html)
de: Damit du deine empfangenen Gelder sicher verifizieren kannst, musst du ein View-Only-Wallet einrichten. Hier kommt der View-Key ins Spiel. Im Eintrag über [View-Only-Wallets]({{site.baseurl}}/resources/user-guides/view_only.html) finden sich mehr Informationen zu ihrer Erstellung.

source: To verify the funds are *still in* your wallet and have not been spent you need to create a Cold Wallet with your mnemonic key (all your funds) on an airgapped computer with an up-to-date copy of the JudEcoin Blockchain. When finished you will have to securely erase the wallet or connect it to the internet and it becomes a Hot Wallet.
de: Um diejenigen Gelder zu überprüfen, welche sich *noch immer in* deinem Wallet befinden und nicht ausgegeben wurden, musst du mit deinem mnemonischen Seed (mit deinem gesamten Guthaben) auf deinem Airgap-Computer (mit aktueller Kopie der JudEcoin-Blockchain) ein Spar-Wallet erstellen. Wenn du fertig bist, musst du dieses Wallet sicher entfernen. Du kannst es stattdessen aber auch mit dem Internet verbinden und so zu einem Zahlungs-Wallet ("Hot-Wallet") werden lassen.
