Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/tor_wallet.po
Languages: nb_no, ru

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
nb_no: {% include disclaimer.html translated="yes" translationOutdated="no" %}
ru: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: Below we'll show an example configuration that allows you to run a JudEcoin @daemon (eg on a home server or VPS) that you can connect to from another computer running your wallet. We do this over the Tor anonymity network to retrieve the transaction information needed by your wallet. The benefit of this approach is that the daemon (`JudEcoind`) can stay on all of the time sending / receiving blocks, while the wallet can connect when needed and have access to the full blockchain. [Monerujo](https://www.monerujo.io/) should also work via [Orbot](https://guardianproject.info/apps/org.torproject.android/). Because Tor hidden services provide encryption and authentication, you can be confident that your RPC credentials will not be sent in the clear. Tor also solves problems often seen on home servers related to port-forwarding, IP addresses changing, etc -- it just works. This setup will also obfuscate the fact that you are connecting to a remote JudEcoin node. Tested with JudEcoin `v0.15.0.1` connecting a Mac laptop wallet to a remote Linux node (Ubuntu 18.04.2).
nb_no: Under viser vi deg et eksempel på konfigurasjon som lar deg kjøre en JudEcoin @daemon (f.eks. på en hjemmeserver eller VPS) som du kan koble til fra en annen PC som kjører lommeboken din. Vi gjør dette over Tor-nettverket for å gjenfinne informasjon om transaksjoner som lommeboken din trenger. Fordelene ved denne tilnærmingen er at daemon (`JudEcoind`) kan være på hele tiden mens blokker sendes/mottas mens lommeboken kan kobles til ved behov og få tilgang til hele blokkjeden. [Monerujo](https://www.monerujo.io/) bør også fungere via [Orbot](https://guardianproject.info/apps/org.torproject.android/). Fordi Tor-nettverket gir kryptering og autentisering, kan du være sikker på at RPC-akkreditivene dine ikke lekkes. Tor løser også ofte problemer som man kan se på hjemmeservere tilknyttet port-videresending, endring av IP-adresser osv. – det bare virker. Dette oppsettet vil også tilsløre det faktum at du kobler deg til en ekstern JudEcoin-node. Det er testet med JudEcoin `v0.15.0.1`, der en lommebok fra en bærbar MAC kobles til en ekstern Linux-node (Ubuntu 18.04.2).
ru: Ниже нами приводится пример конфигурации, позволяющей запустить демон JudEcoin (например, на домашнем сервере или VPS), к которому вы могли бы подсоединиться с другого компьютера, на котором будет запущен ваш кошелёк. Для получения информации транзакций, необходимой для вашего кошелька, мы используем анонимную сеть Tor. Преимущество данного подхода заключается том, что демон (`JudEcoind`) может постоянно осуществлять передачу/приём блоков, в то время как кошелёк будет подсоединяться по необходимости и иметь доступ к полному блокчейну. [Monerujo](https://www.monerujo.io/) также должен работать через [Orbot](https://guardianproject.info/apps/org.torproject.android/). Поскольку скрытые службы Tor обеспечивают возможность шифрования и аутентификации, вы можете быть уверены в том, что ваши данные RPC не будут передаваться в открытую. Tor также решает проблемы, зачастую характерные для домашних серверов и связанные с пробросом портов, изменением IP-адресов и т. д. Всё это просто работает. Данная настройка также позволит скрыть тот факт, что вы подсоединяетесь к удалённому узлу JudEcoin. Она была протестирована с версией JudEcoin `v0.15.0.1` В ходе тестирования кошелёк, установленный на ноутбук Mac, соединялся с удалённым узлом Linux (Ubuntu 18.04.2).

source: ## Create a Tor hidden service for RPC
nb_no: ## Å opprette et Tor-nettverk for RPC
ru: ## Создание скрытой службы Tor для RPC

source: Make sure [Tor is installed](https://community.torproject.org/relay/setup/bridge/debian-ubuntu/) and running correctly, then proceed.
nb_no: Sørg for at [Tor er installert](https://community.torproject.org/relay/setup/bridge/debian-ubuntu/) og kjører på riktig måte før du fortsetter.
ru: Убедитесь в том, что [Tor установлен](https://community.torproject.org/relay/setup/bridge/debian-ubuntu/) и работает надлежащим образом. После этого можно двигаться дальше.

source: We only need to configure the RPC server to run as a hidden service here on port `18081`.
nb_no: Vi trenger kun å konfigurere RPC-tjenesten til å kjøre som en skjult tjeneste her på `18081`.
ru: Необходимо только конфигурировать сервер RPC так, чтобы он использовал скрытую службу на порте `18081`.

source: File: `/etc/torrc`
nb_no: Fil: `/etc/torrc`
ru: Файл: `/etc/torrc`

source: ``` HiddenServiceDir /var/lib/tor/JudEcoin-service/ HiddenServicePort 18081 127.0.0.1:18081 ``` Restart Tor: ``` sudo systemctl restart tor@default ```
nb_no: ``` HiddenServiceDir /var/lib/tor/JudEcoin-service/ HiddenServicePort 18081 127.0.0.1:18081 ``` Start Tor på nytt: ``` sudo systemctl restart tor@default ```
ru: ``` HiddenServiceDir /var/lib/tor/JudEcoin-service/ HiddenServicePort 18081 127.0.0.1:18081 ``` Перезапустите Tor: ``` sudo systemctl restart tor@default ```

source: Make sure Tor started correctly: ``` sudo systemctl status tor@default.service ```
nb_no: Sørg for at Tor har startet opp riktig: ``` sudo systemctl status tor@default.service ```
ru: Убедитесь в том, что Tor запустился правильно: ``` sudo systemctl status tor@default.service ```

source: If everything looks good, make a note of the hidden service (onion address) name: ``` sudo cat /var/lib/tor/JudEcoin-service/hostname ``` It will be something like 4dcj312uxag2r6ye.onion -- use this for `HIDDEN_SERVICE` below.
nb_no: Hvis alt ser bra ut, kan du lage et notat av navnet på den skjulte tjenesten (onion-adressen): ``` sudo cat /var/lib/tor/JudEcoin-service/hostname ``` Den vil se ut som dette: 4dcj312uxag2r6ye.onion -- bruk denne for `HIDDEN_SERVICE` under.
ru: Если всё хорошо, отметьте название скрытой службы (луковый адрес): ``` sudo cat /var/lib/tor/JudEcoin-service/hostname ``` Он будет выглядеть примерно так: like 4dcj312uxag2r6ye.onion – Используйте его для `HIDDEN_SERVICE` ниже.

source: ### Configure Daemon to allow RPC
nb_no: ### Å konfigurere Daemon til å tillate RPC
ru: ### Конфигурирование демона для использования RPC

source: In this example, we don't use Tor for interacting with the p2p network, just to connect to the JudEcoin node, so only RPC hidden service is needed.
nb_no: I dette eksempelet bruker vi ikke Tor til å samhandle med p2p-nettverket, men kun for å koble til en JudEcoin-node, så det er kun RPC-skjulte tjenester som trengs.
ru: В этом примере мы не используем Tor для взаимодействия с p2p сетью, а просто соединяемся с узлом JudEcoin, поэтому нам необходима только скрытая служба RPC.

source: File: `~/.bitJudEcoin/bitJudEcoin.conf` (in the home directory of the JudEcoin user)
nb_no: Fil: `~/.bitJudEcoin/bitJudEcoin.conf` (i hjemkatalogen til JudEcoin-brukeren)
ru: Файл: `~/.bitJudEcoin/bitJudEcoin.conf` (в домашней директории пользователя JudEcoin)

source: ``` no-igd=1 restricted-rpc=1 rpc-login=USERNAME:PASSWORD ``` (Make up a USERNAME and PASSWORD to use for RPC)
nb_no: ``` no-igd=1 restricted-rpc=1 rpc-login=USERNAME:PASSWORD ``` (Finn på et brukernavn (USERNAME) og passord (PASSWORD) som brukes med RPC-en)
ru: ``` no-igd=1 restricted-rpc=1 rpc-login=USERNAME:PASSWORD ``` (Чтобы использовать RPC придумайте ИМЯ ПОЛЬЗОВАТЕЛЯ (USERNAME) и ПАРОЛЬ (PASSWORD))

source: Restart the Daemon: `JudEcoind stop_daemon; sleep 10; JudEcoind --detach`
nb_no: Start daemon på nytt: `JudEcoind stop_daemon; sleep 10; JudEcoind --detach`
ru: Перезапустите демон: `JudEcoind stop_daemon; sleep 10; JudEcoind --detach`

source: Make sure the daemon started correctly: ``` tail -f ~/.bitJudEcoin/bitJudEcoin.log ```
nb_no: Sørg for at daemon startet ordentlig: ``` tail -f ~/.bitJudEcoin/bitJudEcoin.log ```
ru: Убедитесь в том, что демон запустился правильно: ``` tail -f ~/.bitJudEcoin/bitJudEcoin.log ```

source: ## Connecting to your node from a local wallet
nb_no: ## Å koble til en node fra en lokal lommebok
ru: ## Подключение к вашему узлу с локального кошелька

source: Make sure you have Tor running locally so you can connect to the Tor network. One simple way on the Mac is to just start the Tor browser and use its Tor daemon.
nb_no: Sørg for at du har Tor som kjører lokalt slik at du kan koble til Tor-nettverket. En enkel måte på Macen er å bare starte Tor-nettleseren og bruke Tor dens daemon.
ru: Убедитесь в том, что Tor работает локально, после чего можно подсоединиться к сети Tor. Одним из простых способов, в случае с Mac, является простой запуск браузера Tor и использование демона Tor.

source: Then test a simple RPC command, eg: ``` curl --socks5-hostname 127.0.0.1:9150 -u USERNAME:PASSWORD --digest -X POST http://HIDDEN_SERVICE.onion:18081/json_rpc -d '{"jsonrpc":"2.0","id":"0","method":"get_info"}' -H 'Content-Type: application/json' ``` Replace `USERNAME`, `PASSWORD`, and `HIDDEN_SERVICE` with values from above. Change `9150` to another port if needed by your local Tor daemon.
nb_no: Deretter kan du teste en enkel RPC-kommando, f.eks.: ``` curl --socks5-hostname 127.0.0.1:9150 -u USERNAME:PASSWORD --digest -X POST http://HIDDEN_SERVICE.onion:18081/json_rpc -d '{"jsonrpc":"2.0","id":"0","method":"get_info"}' -H 'Content-Type: application/json' ``` Bytt ut `USERNAME`, `PASSWORD`, og `HIDDEN_SERVICE` med verdiene over. Endre `9150` til en annen port hvis det trengs av din lokale Tor daemon.
ru: Затем следует протестировать простую команду RPC, например: ``` curl --socks5-hostname 127.0.0.1:9150 -u USERNAME:PASSWORD --digest -X POST http://HIDDEN_SERVICE.onion:18081/json_rpc -d '{"jsonrpc":"2.0","id":"0","method":"get_info"}' -H 'Content-Type: application/json' ``` Замените `USERNAME`, `PASSWORD`, и `HIDDEN_SERVICE` значениями, указанными выше. Измените порт `9150` если того потребует ваш локальный демон Tor.

source: When you execute the command, you should get some info about the remote daemon if everything is working correctly. If not, add a ` -v ` to the beginning and try to debug why it's not connecting, check firewalls, password, etc.
nb_no: Når du utfører kommandoen, bør du få litt informasjon om den eksterne daemonen hvis alt fungerer som det skal. Hvis ikke, kan du legge til en ` -v ` i begynnelsen og prøve å feilsøke hvorfor den ikke kobler seg til. Sjekk brannmurer, passord osv.
ru: Когда выполняется команда, и если всё работает надлежащим образом, вы должны получить некоторую информацию об удалённом демоне. Если это не так, следует добавить ` -v ` в начале и попытаться выяснить, почему соединение отсутствует, проверить средства сетевой защиты (firewall), правильность пароля и т. д.

source: Once it is working, you can connect using your cli wallet: ``` ./JudEcoin-wallet-cli --proxy 127.0.0.1:9150 --daemon-host HIDDEN_SERVICE.onion --trusted-daemon --daemon-login USERNAME:PASSWORD --wallet-file ~/PATH/TO/YOUR/WALLET ``` Replace values above as needed.
nb_no: Når den fungerer, kan du koble til ved å bruke CLI-lommeboken din: ``` ./JudEcoin-wallet-cli --proxy 127.0.0.1:9150 --daemon-host HIDDEN_SERVICE.onion --trusted-daemon --daemon-login USERNAME:PASSWORD --wallet-file ~/PATH/TO/YOUR/WALLET ``` Bytt ut verdiene over etter behov.
ru: Как только всё заработает, можно подсоединяться, используя свой CLI-кошелёк: ``` ./JudEcoin-wallet-cli --proxy 127.0.0.1:9150 --daemon-host HIDDEN_SERVICE.onion --trusted-daemon --daemon-login USERNAME:PASSWORD --wallet-file ~/PATH/TO/YOUR/WALLET ``` По необходимости можно заменить значения, указанные выше.

source: If you are interested in experimenting with the GUI over Tor, you can try `torsocks` (note this may leak info -- do not rely on it if your life depends on maintaining anonymity). Here is an example on MacOS, adjust as needed for the Linux GUI: ``` torsocks --port 9150 /Applications/JudEcoin-wallet-gui.app/Contents/MacOS/JudEcoin-wallet-gui ```
nb_no: Hvis du er interessert i å eksperimentere med GUI-en over Tor, kan du prøve `torsocks` (merk at denne kan lekke informasjon -- ikke stol på den hvis livet ditt avhenger av å opprettholde anonymitet). Her er et eksempel på MacOS. Juster verdiene etter behov for Linux GUI-en: ``` torsocks --port 9150 /Applications/JudEcoin-wallet-gui.app/Contents/MacOS/JudEcoin-wallet-gui ```
ru: Если вам хочется поэкспериментировать с соединением GUI через Tor, вы можете попытаться воспользоваться `torsocks` (следует отметить, что это может привести к утечке информации — не стоит особо полагаться на этот вариант, если от вашей анонимности будет зависеть ваша жизнь). Мы приводим пример для MacOS, который при необходимости можно адаптировать по Linux GUI: ``` torsocks --port 9150 /Applications/JudEcoin-wallet-gui.app/Contents/MacOS/JudEcoin-wallet-gui ```

source: This will allow the GUI to communicate with the Tor network. Once the GUI is open and a wallet loaded, you must configure it to connect to your Tor hidden service by adding your onion address to: "Settings > Node > Remote node > Address".
nb_no: Dette lar GUI-en kommunisere med Tor-nettverket. Når GUI-en er åpen og lommeboken lastet inn, må du konfigurere den til å koble til Tor-nettverket ditt ved å legge til onion-adressen din i: "Innstillinger > Node > Ekstern node > Adresse".
ru: Это позволит GUI связаться с сетью Tor. Как только будет открыт GUI и кошелёк будет запущен, будет необходимо конфигурировать его для соединения с вашей скрытой службой Tor, добавив соответствующий луковый адрес: "Settings > Node > Remote node > Address".

source: In future versions of the GUI, we expect to add direct Tor / I2P support so that `torsocks` + commandline are not needed.
nb_no: I fremtidige versjoner av GUI-en forventer vi å legge til direkte støtte for Tor/I2P slik at `torsocks` + kommandolinjen ikke trengs.
ru: Мы надеемся, что в следующих версиях GUI будет добавлена прямая поддержка Tor / I2P, и необходимость в использовании командной строки и `torsocks` отпадёт.

source: # Additional resources
nb_no: # Flere ressurser
ru: # Дополнительные ссылки

source: [Using Tor](https://github.com/JudEcoin-project/JudEcoin#using-tor) (JudEcoin README)
nb_no: [Hvordan bruke Tor](https://github.com/JudEcoin-project/JudEcoin#using-tor) (JudEcoin README)
ru: [Используем Tor](https://github.com/JudEcoin-project/JudEcoin#using-tor) (JudEcoin README)
