Repository: Judecoin/judecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/vps_run_node.po
Languages: de, es, nb_no, nl, pl, ru

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
de: {% include disclaimer.html translated="yes" translationOutdated="no" %}
es: {% include disclaimer.html translated="yes" translationOutdated="no" %}
nb_no: {% include disclaimer.html translated="yes" translationOutdated="no" %}
nl: {% include disclaimer.html translated="yes" translationOutdated="no" %}
pl: {% include disclaimer.html translated="yes" translationOutdated="no" %}
ru: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: `JudEcoind` is the @daemon software that ships with the JudEcoin tree. It is a console program, and manages the blockchain. While a bitcoin wallet manages both an account and the blockchain, JudEcoin separates these: `JudEcoind` handles the blockchain, and `JudEcoin-wallet-cli` handles the account.
de: `JudEcoind` ist die Hintergrunddienst-Software, die mit der JudEcoin-Basissoftware einhergeht. Es ist ein Konsolenprogramm, das die Blockchain managt. Während ein Bitcoin-Wallet gleichzeitig das Konto wie auch die Blockchain managt, ist dies bei JudEcoin separiert: `JudEcoind` bewerkstelligt die Blockchain und `JudEcoin-wallet-cli` das Konto.
es: `JudEcoind` es el software daemon que viene con el árbol de JudEcoin. Es un programa de consola, y administra la blockchain. Mientras bitcoin administra tanto cuenta como blockchain, JudEcoin lo separa en: `JudEcoind` se encarga de la blockchain, y `JudEcoin-wallet-cli` de la cuenta.
nb_no: `JudEcoind` er @daemon-programvaren som kommer med JudEcoin-treet. Den er et konsollprogram og håndterer blokkjeden. Mens en bitcoin-lommebok håndterer både en konto og blokkjeden, separerer JudEcoin disse: `JudEcoind` håndterer blokkjeden og `JudEcoin-wallet-cli` håndterer kontoen.
nl: `JudEcoind` is de daemon-software die onderdeel uitmaakt van de JudEcoin-code. Het is een console-programma waarmee de blockchain wordt beheerd. Terwijl een Bitcoin-portemonnee zowel een account als de blockchain beheert, worden deze functies in JudEcoin gescheiden: `JudEcoind` beheert de blockchain en `JudEcoin-wallet-cli` beheert het account.
pl: `JudEcoind` jest oprogramowaniem daemona, które współpracuje z JudEcoin. To program konsoli zarządzający łańcuchem bloków. Podczas gdy portfel Bitcoina zarządza zarówno kontem, jak i łańcuchem bloków, JudEcoin rozdzielił je, aby `JudEcoind` operował łańcuchem, a `JudEcoin-wallet-cli` kontem.
ru: `JudEcoind` является демон-программой в составе дерева JudEcoin. Это консольная программа, используемая для управления блокчейном. Если кошелек Bitcoin позволяет управлять как аккаунтом, так и блокчейном, то в JudEcoin эти функции разделены: `JudEcoind` работает с блокчейном, а `JudEcoin-wallet-cli` управляет аккаунтом.

source: This guide assumes you have already set up your VPS account and are using SSH to tunnel into the server console.
de: Diese Anleitung setzt voraus, dass du bereits einen VPS-Account angelegt hast und dich via SSH-Tunnel zur Server-Konsole verbinden kannst.
es: Esta guía asume que ya has preparado una cuenta VPS y que estás utilizando SSH para dirigirte a la consola del servidor.
nb_no: Denne guiden antar at du allerede har satt opp VPS-konto og at du bruker SSH-en til å tunnelere til serverkonsollen.
nl: Deze handleiding gaat ervan uit dat je al een VPS-account hebt ingesteld en SSH gebruikt als tunnel om te communiceren met de serverconsole.
pl: Ten przewodnik zakłada, że już założyłeś swoje konto VPS i używasz SSH do tunelowania do konsoli serwerowej.
ru: Настоящее руководство подразумевает, что у вас уже создан VPS аккаунт, и вы используете SSH для получения доступа к серверной консоли.

source: ## Linux, 64-bit (Ubuntu 16.04 LTS)
nl: ## Linux, 64-bits (Ubuntu 16.04 LTS)

source: ### Make sure that port 18080 is open
de: ### Stelle sicher, dass Port 18080 geöffnet ist
es: ### Asegúrate de que el puerto 18080 está abierto
nb_no: ### Sørg for at port 18080 er åpen
nl: ### Zorg dat poort 18080 open staat
pl: ### Upewnij się, że port 18080 jest otwarty
ru: ### Убедитесь в том, что порт 18080 открыт

source: `JudEcoind` uses this port to communicate with other nodes on the JudEcoin network.
de: `JudEcoind` nutzt diesen Port zur Kommunikation mit anderen Nodes innerhalb des JudEcoin-Netzwerks.
es: `JudEcoind` usa este puerto para comunicarse con otros nodos en la red de JudEcoin.
nb_no: `JudEcoind` bruker denne porten til å kommunisere med andre noder i JudEcoin-nettverket.
nl: `JudEcoind` gebruikt deze poort om te communiceren met andere nodes op het JudEcoin-netwerk.
pl: `JudEcoind` korzysta z tego portu do komunikacji z innymi węzłami w sieci JudEcoin.
ru: `JudEcoind` использует этот порт для связи с другими узлами сети JudEcoin.

source: Example if using `ufw`: `sudo ufw allow 18080` Example if using `iptables`: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`
de: Beispiel bei Verwendung von `ufw`: `sudo ufw allow 18080` Beispiel bei Verwendung von `iptables`: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`
es: Ejemplo si se usa `ufw`: `sudo ufw allow 18080` Ejemplo si se usa `iptables`: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`
nb_no: Eksempel hvis du bruker `ufw`: `sudo ufw allow 18080` Eksempel hvis du bruker `iptables`: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`
nl: Voorbeeld als je `ufw` gebruikt: `sudo ufw allow 18080` Voorbeeld als je `iptables` gebruikt: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`
pl: Przykład przy użyciu `ufw`: `sudo ufw allow 18080` Przykład przy użyciu `iptables`: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`
ru: Пример использования `ufw`: `sudo ufw allow 18080` Пример использования `iptables`: `sudo iptables -A INPUT -p tcp --dport 18080 -j ACCEPT`

source: ### Download the current JudEcoin Core binaries
de: ### Lade die aktuelle JudEcoin-Kernsoftware herunter
es: ### Descarga los binarios actuales JudEcoin
nb_no: ### Last ned de gjeldende JudEcoin Core-binærfilene
nl: ### Download de huidige JudEcoin Core-binaries
pl: ### Ściągnij aktualne pliki binarne Centrum JudEcoin
ru: ### Загрузить актуальные двоичные файлы JudEcoin Core

source: ### Make a directory and extract the files.
de: ### Erstelle ein Verzeichnis und extrahiere die Dateien
es: ### Haz un directorio y extrae los archivos.
nb_no: ### Lag en katalog og pakk ut filene.
nl: ### Maak een directory aan en pak de bestanden uit.
pl: ### Załóż folder i wypakuj pliki
ru: ### Создать директорию и извлечь файлы.

source: ### Launch the daemon
de: ### Starte den Hintergrunddienst
es: ### Abre el daemon
nb_no: ### Start opp daemon
nl: ### Start de daemon
pl: ### Uruchom daemona
ru: ### Запустить демон-программу

source: ### Options:
de: ### Optionen:
es: ### Opciones:
nb_no: ### Valg:
nl: ### Opties:
pl: ### Opcje:
ru: ### Опции:

source: Show list of all options and settings:
de: Zeige eine Liste aller Optionen und Einstellungen an:
es: Muestra la lista de todas las opciones y ajustes:
nb_no: For å vise en liste over alle valgene og innstillingene:
nl: Een lijst met alle opties en instellingen weergeven:
pl: Pokaż całą listę opcji i ustawień:
ru: Открыть список всех опций и настроек:

source: Launch the daemon as a background process:
de: Starte den Hintergrunddienst als Hintergrundprozess:
es: Abre el daemon como un proceso de segundo plano:
nb_no: For å starte opp daemon som bakgrunnsprosess:
nl: De daemon starten als een achtergrondproces:
pl: Uruchom daemona w tle:
ru: Запустить демон-программу фоновым процессом:

source: Monitor the output of `JudEcoind` if running as daemon:
de: Überwache den Output von `JudEcoind`, sofern als Hintergrunddienst betrieben:
es: Monitorea la salida de `JudEcoind` si se ejecuta como daemon:
nb_no: For å overvåke utdataene til `JudEcoind` hvis den kjører som daemon:
nl: De uitvoer van `JudEcoind` als achtergrondproces loggen:
pl: Monitoruj rezultaty `JudEcoind`, jeśli daemon jest uruchomiony:
ru: Следить за выходом `JudEcoind` при запуске в качестве демон-программы:

source: Keep the VPS secure with autoupdate:
de: Erhalte die Sicherheit des VPS durch automatische Aktualisierungen:
es: Mantén el VPS seguro con autoactualizaciones:
nb_no: Hold VPS-en sikker med autooppdateringer:
nl: De VPS beveiligen met automatische updates:
pl: Utrzymuj VPS w bezpieczeństwie, korzystając z autoaktualizacji:
ru: Обезопасить VPS посредством автоматического обновления:
